{
  "scenes": {
    "start": {
      "text": "You wake up in a mysterious forest. The sun is setting and you hear strange noises in the distance. You see two paths ahead of you.",
      "choices": [
        {
          "text": "Take the left path towards the glowing lights",
          "nextScene": "left_path"
        },
        {
          "text": "Take the right path towards the sound of water",
          "nextScene": "right_path"
        }
      ]
    },
    "left_path": {
      "text": "You follow the glowing lights and discover a friendly village of forest spirits. They offer you magical berries.",
      "choices": [
        {
          "text": "Accept the berries and eat them",
          "nextScene": "magic_berries"
        },
        {
          "text": "Politely decline and continue exploring",
          "nextScene": "continue_exploring"
        }
      ]
    },
    "right_path": {
      "text": "You follow the sound of water and find a beautiful waterfall with a hidden cave behind it. The cave entrance looks ancient.",
      "choices": [
        {
          "text": "Enter the cave to explore",
          "nextScene": "ancient_cave"
        },
        {
          "text": "Stay by the waterfall and rest",
          "nextScene": "waterfall_rest"
        }
      ]
    },
    "magic_berries": {
      "text": "The berries give you the ability to understand animal language! You befriend the forest creatures and become the guardian of the forest.",
      "choices": []
    },
    "continue_exploring": {
      "text": "You continue through the forest and eventually find your way back home, with amazing stories to tell about your adventure.",
      "choices": []
    },
    "ancient_cave": {
      "text": "Inside the cave, you discover ancient treasure and mysterious writings on the walls. This could be a great archaeological discovery!",
      "choices": [
        {
          "text": "Study the writings and become an archaeologist",
          "nextScene": "archaeologist"
        },
        {
          "text": "Take some treasure and return home wealthy",
          "nextScene": "treasure"
        }
      ]
    },
    "waterfall_rest": {
      "text": "While resting, you notice a hidden message carved near the waterfall that leads you to a secret garden of eternal peace.",
      "choices": []
    },
    "archaeologist": {
      "text": "Your discovery makes you famous! You spend your life uncovering ancient mysteries and become a renowned archaeologist.",
      "choices": []
    },
    "treasure": {
      "text": "You return home with incredible wealth and live a comfortable life, always remembering your amazing adventure.",
      "choices": []
    }
  }
}