{
    "scenes": {
        "start": {
            "text": "You wake up in a mysterious forest. The sun is setting and you need to find shelter. To your left, you see a dark cave. To your right, a narrow path leads deeper into the woods.",
            "choices": [
                {
                    "text": "Enter the dark cave",
                    "nextScene": "cave"
                },
                {
                    "text": "Follow the narrow path",
                    "nextScene": "path"
                }
            ]
        },
        "cave": {
            "text": "The cave is dark and damp. As your eyes adjust, you see two tunnels branching off. One has a faint glowing light, the other smells of fresh air.",
            "choices": [
                {
                    "text": "Follow the glowing tunnel",
                    "nextScene": "treasure"
                },
                {
                    "text": "Take the tunnel with fresh air",
                    "nextScene": "exit"
                }
            ]
        },
        "path": {
            "text": "The path leads to an ancient stone bridge over a rushing river. The bridge looks unstable. You hear strange noises from the forest behind you.",
            "choices": [
                {
                    "text": "Cross the unstable bridge",
                    "nextScene": "bridge"
                },
                {
                    "text": "Go back and find another way",
                    "nextScene": "start"
                }
            ]
        },
        "treasure": {
            "text": "You discover a hidden chamber filled with glittering treasure! A friendly dragon appears and offers to grant you one wish for being so brave.",
            "choices": [
                {
                    "text": "Wish for unlimited wealth",
                    "nextScene": "wealth_ending"
                },
                {
                    "text": "Wish to return home safely",
                    "nextScene": "home_ending"
                }
            ]
        },
        "exit": {
            "text": "The tunnel leads you safely out of the cave system. You find yourself at the edge of a peaceful village where you're welcomed as a hero!",
            "choices": []
        },
        "bridge": {
            "text": "As you carefully cross the bridge, it suddenly collapses! You manage to grab onto a vine and swing to safety on the other side, where you discover a hidden waterfall.",
            "choices": [
                {
                    "text": "Explore behind the waterfall",
                    "nextScene": "waterfall"
                },
                {
                    "text": "Follow the river downstream",
                    "nextScene": "river"
                }
            ]
        },
        "waterfall": {
            "text": "Behind the waterfall is a secret garden with magical plants that heal all your wounds. You decide to live here peacefully, learning the secrets of the forest.",
            "choices": []
        },
        "river": {
            "text": "Following the river, you're found by forest rangers who help you return to civilization. Your adventure becomes a legendary story told for generations.",
            "choices": []
        },
        "wealth_ending": {
            "text": "The dragon grants your wish! You become the richest person in the kingdom, using your wealth to help others and build a better world.",
            "choices": []
        },
        "home_ending": {
            "text": "In a flash of light, you're transported safely back home with amazing stories to tell. You live a happy life, always remembering your magical adventure.",
            "choices": []
        }
    }
}